<template>
 <div class="help">
   <div class="desc">
     大玩家是一款基于星云链开发的数字竞猜类区块链小游戏。在本游戏中，玩家可以发起竞猜，也可以参与别人发起的竞猜，发起和参与竞猜将有机会获得数量不等的NAS奖励。本游戏所有核心业务逻辑及数据，将永久运行和保存在基于星云区块链的智能合约中。合约代码开源，不可篡改，游戏简单有趣，公平公正。
   </div>
   <div class="rules">
     <div class="title">
       游戏规则：
     </div>
     <div class="info">
       <p>1. 发起竞猜可以选择5-10个竞猜选项。比如：发起5个选项的竞猜，则竞猜选项包含1、2、3、4、5这几个数字，以此类推。</p>
       <p>2. 发起n个选项的竞猜，则发起人需支付0.01 * n 个NAS作为竞猜人中奖奖励。比如：发起5个选项的竞猜，则发起人需支付0.01 * 5 = 0.05 NAS，作为竞猜人奖励。</p>
       <p>3. 发起竞猜时，当前竞猜的正确答案将在智能合约中随机生成，无人可以篡改和提前知晓。</p>
       <p>3. 竞猜人每次参与竞猜，需支付0.01个NAS作为发起人的奖励。（因每次参与竞猜均需成本，轮刷答案得不偿失，故不限制单人参与单期竞猜次数，玩家拼的是运气。）</p>
       <p>4. 每期竞猜不限参与人次，直至有人猜中正确答案。</p>
       <p>5. 每期竞猜有人猜中正确答案时，将同时发放竞猜赢家与竞猜发起人奖励。竞猜赢家获得的奖励为发起人支付的发起费用，比如第2条中的0.05NAS。
         竞猜发起人获得的奖励，为所有参与本期竞猜者所支付的费用，比如第10个人猜中答案，则发起人获得的奖励为0.01 * 10 = 0.1 NAS 。</p>
       <!-- <p>6. 手续费</p> -->
     </div>
   </div>
   <div class="limit">
     <div class="title">
       免责声明：
     </div>
     <div class="info">
       用户在本平台的所有行为及结果，均由用户自行负责。平台默认用户完全理解并接受所有规则，如发生纠纷平台概不负责。
     </div>
   </div>
 </div>
</template>

<script>
export default {
}
</script>

<style scoped>
.desc {
  margin-bottom: 30px;
}
.rules {
  margin-bottom: 30px;
}

.info {
  font-size: 14px;
  color: #34495e;
}
</style>
